tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "microsoft/mssql-release"

# general tools
brew "mas" # required to install apps from MacAppStore
brew "zsh" # my favorite shell
cask "rectangle" # window manager
mas "1Password 7", id: 1333542190
mas "Amphetamine", id: 937984704
mas "Keka", id: 470158793

# general development tools
brew "git-flow"
brew "pre-commit"
cask "iterm2"
cask "fig"
cask "atom"
mas "Kaleidoscope", id: 587512244
mas "Microsoft Remote Desktop", id: 1295203466

# Office/Documentation
cask "mactex"

# Database related tools
brew "microsoft/mssql-release/msodbcsql17"
brew "microsoft/mssql-release/mssql-tools"

# Data engineering tools
brew "dvc"

# python Development Tools
brew "poetry"
brew "python@3.8"
brew "python@3.9"
brew "python@3.10"
cask "pycharm"

# JS development
brew "node"

# Container development
brew "hyperkit" # small virtualization framework
brew "kubernetes-cli"
brew "minikube"
brew "docker"
brew "docker-compose"
cask "lens"

# Cloud development
brew "awscli"
brew "aws-iam-authenticator"

# Graphic tools
cask "drawio"
brew "graphviz"
mas "Pixelmator Pro", id: 1289583905
